habitrak/app/views/habits/chart.js.erb

SELECT "habits".* FROM "habits" WHERE "habits"."id" IN (3, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 1, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 2, 2, 2, 1, 1, 2, 2, 1, 1, 2, 2, 2, 1, 1, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 1, 2, 2, 2, 1, 2, 1, 2, 1, 1, 1, 1, 2, 2, 2, 2, 2, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 1, 2, 2, 2) ORDER BY name ASC
SELECT COUNT(*) FROM "habits_users" WHERE (user_id='1' AND habit_id = 2 AND habit_time BETWEEN '2013-04-28 04:00:00' AND '2013-04-29 04:00:00')
SELECT COUNT(*) FROM "users_habits" WHERE (user_id='1' AND habit_id=2)
---

$(document).ready(function() {
	$("#trends_dropdown").val('<%= cookies[:trend] %>');
	Morris.Line({
	  element: 'habit_chart',
	  data: [
	    <% @start_date.upto(@end_date).each do |date| %>
	      <% start_date = date.change(:offset => "-04:00:00 +0000").to_datetime %>
	      <% end_date = start_date.tomorrow %>
      	{ d: '<%= start_date.to_date%>',
        <% @habits.each do |habit| %>
        <% @habit_types = UsersHabit.where('user_id=? AND habit_id=?', @current_user_id, habit.id).count %>
      	<% daily_count = HabitsUser.where("user_id=? AND habit_id = ? AND habit_time BETWEEN ? AND ?", @current_user_id, habit.id, start_date, end_date).count %>
      	  <%if @habit_types > 0 %>
   				  h<%= habit.id%>: <%= daily_count %>,
				  <% end %>
				<% end %>
				},
  	<% end %>
		],
		xLabelFormat: function(d) {
      <% if cookies[:trend] == '4' || cookies[:trend] == '5' || cookies[:trend] == '6' %>