habitrak/app/controllers/access_controller.rb

   def attempt_login
     authorized_user = User.authenticate(params[:email], params[:pass])
     if authorized_user
       session[:user_id] = authorized_user.id
       if params[:remember_me][:remember] == '1'
         cookies.signed[:user_id] = { :value => authorized_user.id.to_s, :expires => 2.weeks.from_now }
       end
       flash[:alert] = "Welcome back #{authorized_user.first_name.capitalize}!"
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'ctelliott@gmail.com' LIMIT 1