habitrak/app/controllers/habits_controller.rb

SELECT "habits".* FROM "habits" WHERE "habits"."id" IN (1, 2, 3) ORDER BY name ASC
SELECT "users_habits".* FROM "users_habits" WHERE (user_id='1')
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "habits" WHERE "habits"."id" IN (1, 2, 3)
---
  def entry
    show_menu
    habit_ids = UsersHabit.where("user_id=?", current_user_id).collect {|i| i.habit_id}
    @habits = Habit.order("name ASC").where(:id => habit_ids)
    @user = User.find(current_user_id)
    if @habits.empty?

SELECT "habits".* FROM "habits" WHERE "habits"."id" IN (3, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 1, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 2, 2, 2, 1, 1, 2, 2, 1, 1, 2, 2, 2, 1, 1, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 1, 2, 2, 2, 1, 2, 1, 2, 1, 1, 1, 1, 2, 2, 2, 2, 2, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 1, 2, 2, 2) ORDER BY name ASC
SELECT "habits_users".* FROM "habits_users" WHERE (user_id='1')
---
  def chart
    @current_user_id = current_user_id
    daily_habits = HabitsUser.where("user_id=?", @current_user_id).collect {|i| i.habit_id}

SELECT COUNT(*) FROM "habits_users" WHERE (user_id='1')
---
  def trends
    show_menu
    habit_check = HabitsUser.where("user_id=?", current_user_id).count

SELECT "habits".* FROM "habits" WHERE "habits"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "habits_users".* FROM "habits_users" WHERE (user_id = '1' AND habit_id=2) ORDER BY "habits_users"."id" DESC LIMIT 1
UPDATE "habits_users" SET "habit_time" = '2013-05-02 21:51:27.000000', "updated_at" = '2013-05-02 21:51:27.238846' WHERE "habits_users"."id" = 805
---
  def add
    @habit = Habit.find(params[:add][:habit])
    @habit.users << User.find(current_user_id)
    @habit_user = HabitsUser.where('user_id = ? AND habit_id=?', current_user_id, @habit).last
    @habit_user.habit_time = Time.now.in_time_zone(cookies[:time_stamp]).to_datetime
    @habit_user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "habits".* FROM "habits" WHERE "habits"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "habits_users".* FROM "habits_users" WHERE (user_id = '1' AND habit_id=1) ORDER BY "habits_users"."id" DESC LIMIT 1
DELETE FROM "habits_users" WHERE "habits_users"."id" = 1571
---
  def undo
    @user = User.find(current_user_id)
    @habit = Habit.find(params[:undo][:habit])
    @habit_user = HabitsUser.where('user_id = ? AND habit_id=?', current_user_id, @habit).last
    @habit_user.delete