habitrak/app/controllers/settings_controller.rb

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" IN (0, 1) ORDER BY name ASC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
		show_menu
		@habits = Habit.order("name ASC").find_all_by_user_id([0, current_user_id])
		@user = User.find(current_user_id)

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" IN (0, 1) ORDER BY name ASC
---
  def habit_types
		@habits = Habit.order("name ASC").find_all_by_user_id([0, current_user_id])