habitrak/app/controllers/users_controller.rb

  def create
    show_public_menu
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password", "temp_pass", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"